// создание базы данных цикл от 1 до 10 и при помощи промтр вводится 10 пользователей: имя и возраст
// итерация это id пользователя | id неможет быть 0 , и в эту итерацию записывается данные имени и возраста
// вывод в консоль

let pusto = {}
for (let i = 1; i <= 10; i++) {
   let users = prompt('Введите имя пользователя');
   let ages = +prompt('Введите возраст пользователя');

   pusto[i] = {
       users,
        ages
   } 
   console.log(`Польователь ${i} - имя ${pusto[i]['users']} , возраст ${pusto[i]['ages']} лет`);
}
